Autodesk.Revit.DB.Level.GetNearestLevelId(Autodesk.Revit.DB.Document,System.Double)
Returns id of the Level which is closest to the specified elevation.
Remarks:
The level can be at, above or below the target elevation.
If there is more than one Level at the same distance from the elevation, the Level with the lowest Id will be returned.
document:
The document.
elevation:
Target Elevation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Level.GetNearestLevelId(Autodesk.Revit.DB.Document,System.Double,System.Double@)
Returns id of the Level which is closest to the specified elevation.
Remarks:
The level can be at, above or below the target elevation.
If there is more than one Level at the same distance from the elevation, the Level with the lowest Id will be returned.
document:
The document.
elevation:
Target Elevation.
offset:
Vertical offset from the level to the target elevation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Level.Create(Autodesk.Revit.DB.Document,System.Double)
Creates a new instance of level based on an input elevation.
document:
The document in which the new instance is created
elevation:
The elevation of the level to be created.
Returns:
The newly created level instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null